app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]
---
  def index
    @tasks = current_user.tasks.page(params[:page]).per_page(2)

INSERT INTO "tasks" ("title", "description", "status", "deadline", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create

    @task = current_user.tasks.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "title" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["title", "tets 2"], ["updated_at", "2024-06-22 10:42:05.925838"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)