app/models/task.rb

SELECT "tasks".* FROM "tasks" WHERE (deadline <= '2024-06-22 14:05:03.413907' OR deadline <= '2024-06-23 13:05:03.430156') AND "tasks"."status" != $1  [["status", 1]]
---
  def self.check_deadlines_and_send_emails
    pending_tasks = where("deadline <= ?", 1.hour.from_now).or(where("deadline <= ?", 1.day.from_now)).where.not(status: "Done")

    pending_tasks.each do |task|